therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                <register>
                    <name>SYSCTL_GENCLKCFG</name>
                    <description>General clock configuration</description>
                    <addressOffset>0x1138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1ffff3f7</resetMask>
                    <fields>
                        <field>
                            <name>HFCLK4MFPCLKDIV</name>
                            <description>HFCLK4MFPCLKDIV selects the divider applied to HFCLK when HFCLK is used as the MFPCLK source.  Integer dividers from /1 to /16 may be selected.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIV1</name>
                                        <description>HFCLK is not divided before being used for MFPCLK</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV2</name>
                                        <description>HFCLK is divided by 2 before being used for MFPCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV3</name>
                                        <description>HFCLK is divided by 3 before being used for MFPCLK</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV4</name>
                                        <description>HFCLK is divided by 4 before being used for MFPCLK</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV5</name>
                                        <description>HFCLK is divided by 5 before being used for MFPCLK</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV6</name>
                                        <description>HFCLK is divided by 6 before being used for MFPCLK</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV7</name>
                                        <description>HFCLK is divided by 7 before being used for MFPCLK</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV8</name>
                                        <description>HFCLK is divided by 8 before being used for MFPCLK</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV9</name>
                                        <description>HFCLK is divided by 9 before being used for MFPCLK</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV10</name>
                                        <description>HFCLK is divided by 10 before being used for MFPCLK</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV11</name>
                                        <description>HFCLK is divided by 11 before being used for MFPCLK</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV12</name>
                                        <description>HFCLK is divided by 12 before being used for MFPCLK</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV13</name>
                                        <description>HFCLK is divided by 13 before being used for MFPCLK</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV14</name>
                                        <description>HFCLK is divided by 14 before being used for MFPCLK</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV15</name>
                                        <description>HFCLK is divided by 15 before being used for MFPCLK</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV16</name>
                                        <description>HFCLK is divided by 16 before being used for MFPCLK</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MFPCLKSRC</name>
                            <description>MFPCLKSRC selects the MFPCLK (middle frequency precision clock) source.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSOSC</name>
                                        <description>MFPCLK is sourced from SYSOSC</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HFCLK</name>
                                        <description>MFPCLK is sourced from HFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CANCLKSRC</name>
                            <description>CANCLKSRC selects the CANCLK source.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>HFCLK</name>
                                        <description>CANCLK source is HFCLK</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSPLLOUT1</name>
                                        <description>CANCLK source is SYSPLLCLK1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FCCTRIGCNT</name>
                            <description>FCCTRIGCNT specifies the number of trigger clock periods in the trigger window. FCCTRIGCNT=0h (one trigger clock period) up to 1Fh (32 trigger clock periods) may be specified.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>ANACPUMPCFG</name>
                            <description>ANACPUMPCFG selects the analog mux charge pump (VBOOST) enable method.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ONDEMAND</name>
                                        <description>VBOOST is enabled on request from a COMP, GPAMP, or OPA</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONACTIVE</name>
                                        <description>VBOOST is enabled when the device is in RUN or SLEEP mode, or when a COMP/GPAMP/OPA is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONALWAYS</name>
                                        <description>VBOOST is always enabled</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FCCSELCLK</name>
                            <description>FCCSELCLK selectes the frequency clock counter (FCC) clock source.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MCLK</name>
                                        <description>FCC clock is MCLK</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSOSC</name>
                                        <description>FCC clock is SYSOSC</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HFCLK</name>
                                        <description>FCC clock is HFCLK</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EXTCLK</name>
                                        <description>FCC clock is the CLK_OUT selection</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSPLLCLK0</name>
                                        <description>FCC clock is SYSPLLCLK0</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSPLLCLK1</name>
                                        <description>FCC clock is SYSPLLCLK1</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSPLLCLK2X</name>
                                        <description>FCC clock is SYSPLLCLK2X</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FCCIN</name>
                                        <description>FCC clock is the FCCIN external input</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FCCTRIGSRC</name>
                            <description>FCCTRIGSRC selects the frequency clock counter (FCC) trigger source.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>EXTPIN</name>
                                        <description>FCC trigger is the external pin</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LFCLK</name>
                                        <description>FCC trigger is the LFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FCCLVLTRIG</name>
                            <description>FCCLVLTRIG selects the frequency clock counter (FCC) trigger mode.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>RISE2RISE</name>
                                        <description>Rising edge to rising edge triggered</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LEVEL</name>
                                        <description>Level triggered</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EXCLKSRC</name>
                            <description>EXCLKSRC selects the source for the CLK_OUT external clock output block.  ULPCLK and MFPCLK require the CLK_OUT divider (EXCLKDIVEN) to be enabled</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSOSC</name>
                                        <description>CLK_OUT is SYSOSC</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ULPCLK</name>
                                        <description>CLK_OUT is ULPCLK (EXCLKDIVEN must be enabled)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LFCLK</name>
                                        <description>CLK_OUT is LFCLK</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MFPCLK</name>
                                        <description>CLK_OUT is MFPCLK (EXCLKDIVEN must be enabled)</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HFCLK</name>
                                        <description>CLK_OUT is HFCLK</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSPLLOUT1</name>
                                        <description>CLK_OUT is SYSPLLCLK1 (SYSPLLCLK1 must be &amp;lt;=48MHz)</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EXCLKDIVVAL</name>
                            <description>EXCLKDIVVAL selects the divider value for the divider in the CLK_OUT external clock output block.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIV2</name>
                                        <description>CLK_OUT source is divided by 2</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV4</name>
                                        <description>CLK_OUT source is divided by 4</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV6</name>
                                        <description>CLK_OUT source is divided by 6</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV8</name>
                                        <description>CLK_OUT source is divided by 8</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV10</name>
                                        <description>CLK_OUT source is divided by 10</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV12</name>
                                        <description>CLK_OUT source is divided by 12</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV14</name>
                                        <description>CLK_OUT source is divided by 14</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV16</name>
                                        <description>CLK_OUT source is divided by 16</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EXCLKDIVEN</name>
                            <description>EXCLKDIVEN enables or disables the divider function of the CLK_OUT external clock output block.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>PASSTHRU</name>
                                        <description>CLock divider is disabled (passthrough, EXCLKDIVVAL is not applied)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Clock divider is enabled (EXCLKDIVVAL is applied)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
