therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                <register>
                    <name>SYSCTL_RSTCAUSE</name>
                    <description>Reset cause</description>
                    <addressOffset>0x1220</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>ID</name>
                            <description>ID is a read-to-clear field which indicates the lowest level reset cause since the last read.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NORST</name>
                                        <description>No reset since last read</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PORHWFAIL</name>
                                        <description>POR- violation, SHUTDNSTOREx or PMU trim parity fault</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>POREXNRST</name>
                                        <description>NRST triggered POR (&amp;gt;1s hold)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PORSW</name>
                                        <description>Software triggered POR</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORSUPPLY</name>
                                        <description>BOR0- violation</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORWAKESHUTDN</name>
                                        <description>SHUTDOWN mode exit</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTNONPMUPARITY</name>
                                        <description>Non-PMU trim parity fault</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTCLKFAIL</name>
                                        <description>Fatal clock failure</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTSW</name>
                                        <description>Software triggered BOOTRST</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTEXNRST</name>
                                        <description>NRST triggered BOOTRST (&amp;lt;1s hold)</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSBSLEXIT</name>
                                        <description>BSL exit</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSBSLENTRY</name>
                                        <description>BSL entry</description>
                                        <value>0x11</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSWWDT0</name>
                                        <description>WWDT0 violation</description>
                                        <value>0x12</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSWWDT1</name>
                                        <description>WWDT1 violation</description>
                                        <value>0x13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSFLASHECC</name>
                                        <description>Flash uncorrectable ECC error</description>
                                        <value>0x14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSCPULOCK</name>
                                        <description>CPULOCK violation</description>
                                        <value>0x15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSDBG</name>
                                        <description>Debug triggered SYSRST</description>
                                        <value>0x1A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSSW</name>
                                        <description>Software triggered SYSRST</description>
                                        <value>0x1B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CPUDBG</name>
                                        <description>Debug triggered CPURST</description>
                                        <value>0x1C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CPUSW</name>
                                        <description>Software triggered CPURST</description>
                                        <value>0x1D</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_RESETLEVEL</name>
                    <description>Reset level for application-triggered reset command</description>
                    <addressOffset>0x1300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>LEVEL</name>
                            <description>LEVEL is used to specify the type of reset to be issued when RESETCMD is set to generate a software triggered reset.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CPU</name>
                                        <description>Issue a SYSRST (CPU plus peripherals only)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOT</name>
                                        <description>Issue a BOOTRST (CPU, peripherals, and boot configuration routine)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTLOADERENTRY</name>
                                        <description>Issue a SYSRST and enter the boot strap loader (BSL)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>POR</name>
                                        <description>Issue a power-on reset (POR)</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BOOTLOADEREXIT</name>
                                        <description>Issue a SYSRST and exit the boot strap loader (BSL)</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_RESETCMD</name>
                    <description>Execute an application-triggered reset command</description>
                    <addressOffset>0x1304</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>GO</name>
                            <description>Execute the reset specified in RESETLEVEL.LEVEL.  Must be written together with the KEY.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Issue reset</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_BORTHRESHOLD</name>
                    <description>BOR threshold selection</description>
                    <addressOffset>0x1308</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>LEVEL</name>
                            <description>LEVEL specifies the desired BOR threshold and BOR mode.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BORMIN</name>
                                        <description>Default minimum threshold; a BOR0- violation triggers a BOR</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORLEVEL1</name>
                                        <description>A BOR1- violation generates a BORLVL interrupt</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORLEVEL2</name>
                                        <description>A BOR2- violation generates a BORLVL interrupt</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BORLEVEL3</name>
                                        <description>A BOR3- violation generates a BORLVL interrupt</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_BORCLRCMD</name>
                    <description>Set the BOR threshold</description>
                    <addressOffset>0x130C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>GO</name>
                            <description>GO clears any prior BOR violation status indications and attempts to change the active BOR mode to that specified in the LEVEL field of the BORTHRESHOLD register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Issue clear</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSOSCFCLCTL</name>
                    <description>SYSOSC frequency correction loop (FCL) ROSC enable</description>
                    <addressOffset>0x1310</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000003</resetMask>
                    <fields>
                        <field>
                            <name>SETUSEFCL</name>
                            <description>Set SETUSEFCL to enable the frequency correction loop in SYSOSC.  Once enabled, this state is locked until the next BOOTRST.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Enable the SYSOSC FCL</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SETUSEEXRES</name>
                            <description>Set SETUSEEXRES to specify that an external resistor will be used for the FCL.  An appropriate resistor must be populated on the ROSC pin.  This state is locked until the next BOOTRST.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Enable the SYSOSC external Resistor</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_LFXTCTL</name>
                    <description>LFXT and LFCLK control</description>
                    <addressOffset>0x1314</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000003</resetMask>
                    <fields>
                        <field>
                            <name>SETUSELFXT</name>
                            <description>Set SETUSELFXT to switch LFCLK to LFXT.  Once set, SETUSELFXT remains set until the next BOOTRST.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Use LFXT as the LFCLK source</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STARTLFXT</name>
                            <description>Set STARTLFXT to start the low frequency crystal oscillator (LFXT).  Once set, STARTLFXT remains set until the next BOOTRST.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>LFXT not started</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Start LFXT</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_EXLFCTL</name>
                    <description>LFCLK_IN and LFCLK control</description>
                    <addressOffset>0x1318</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SETUSEEXLF</name>
                            <description>Set SETUSEEXLF to switch LFCLK to the LFCLK_IN digital clock input.  Once set, SETUSEEXLF remains set until the next BOOTRST.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Use LFCLK_IN as the LFCLK source</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHDNIOREL</name>
                    <description>SHUTDOWN IO release control</description>
                    <addressOffset>0x131C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>RELEASE</name>
                            <description>Set RELEASE to release the IO after a SHUTDOWN mode exit.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Release IO</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
