therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                    <register>
                        <name>EVENTLP_DIAGPAR180</name>
                        <description>Diagnostic Parity Register 180</description>
                        <addressOffset>0x11C</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR179</name>
                        <description>Diagnostic Parity Register 179</description>
                        <addressOffset>0x120</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR178</name>
                        <description>Diagnostic Parity Register 178</description>
                        <addressOffset>0x124</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR177</name>
                        <description>Diagnostic Parity Register 177</description>
                        <addressOffset>0x128</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR176</name>
                        <description>Diagnostic Parity Register 176</description>
                        <addressOffset>0x12C</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR175</name>
                        <description>Diagnostic Parity Register 175</description>
                        <addressOffset>0x130</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR174</name>
                        <description>Diagnostic Parity Register 174</description>
                        <addressOffset>0x134</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR173</name>
                        <description>Diagnostic Parity Register 173</description>
                        <addressOffset>0x138</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR172</name>
                        <description>Diagnostic Parity Register 172</description>
                        <addressOffset>0x13C</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR171</name>
                        <description>Diagnostic Parity Register 171</description>
                        <addressOffset>0x140</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR170</name>
                        <description>Diagnostic Parity Register 170</description>
                        <addressOffset>0x144</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR169</name>
                        <description>Diagnostic Parity Register 169</description>
                        <addressOffset>0x148</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR168</name>
                        <description>Diagnostic Parity Register 168</description>
                        <addressOffset>0x14C</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>EVENTLP_DIAGPAR167</name>
                        <description>Diagnostic Parity Register 167</description>
                        <addressOffset>0x150</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>ASSERTDIAG</name>
                                <description>Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No Effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>START</name>
                                            <description>Generate diagnostic check</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
