therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN14</name>
                            <description>Programmable counter length of digital glitch filter for DIN14</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN15</name>
                            <description>Programmable counter length of digital glitch filter for DIN15</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>GPIOA_FILTEREN31_16</name>
                    <description>Filter Enable 31 to 16</description>
                    <addressOffset>0x150C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN16</name>
                            <description>Programmable counter length of digital glitch filter for DIN16</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN17</name>
                            <description>Programmable counter length of digital glitch filter for DIN17</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN18</name>
                            <description>Programmable counter length of digital glitch filter for DIN18</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN19</name>
                            <description>Programmable counter length of digital glitch filter for DIN19</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN20</name>
                            <description>Programmable counter length of digital glitch filter for DIN20</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN21</name>
                            <description>Programmable counter length of digital glitch filter for DIN21</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN22</name>
                            <description>Programmable counter length of digital glitch filter for DIN22</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN23</name>
                            <description>Programmable counter length of digital glitch filter for DIN23</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN24</name>
                            <description>Programmable counter length of digital glitch filter for DIN24</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN25</name>
                            <description>Programmable counter length of digital glitch filter for DIN25</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN26</name>
                            <description>Programmable counter length of digital glitch filter for DIN26</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
