therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                <register>
                    <name>OPA0_CFG</name>
                    <description>Configuration Register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CHOP</name>
                            <description>Chopping enable.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>OFF</name>
                                        <description>Chopping disable.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ON</name>
                                        <description>Standard chopping enable.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>AVGON</name>
                                        <description>Chop with post average on. Requires output to be connect to ADC in average mode.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>OUTPIN</name>
                            <description>Enable output pin</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLED</name>
                                        <description>Output pin disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLED</name>
                                        <description>Output pin enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>PSEL</name>
                            <description>Positive OA input selection.  
Please refer to the device specific datasheet for exact channels available.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NC</name>
                                        <description>No connect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EXTPIN0</name>
                                        <description>external pin OA+0</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EXTPIN1</name>
                                        <description>external pin OAn+1</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DAC12OUT</name>
                                        <description>DAC12OUT</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DAC8OUT</name>
                                        <description>DAC8OUT</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>VREF</name>
                                        <description>VREF Channel</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OANM1RTOP</name>
                                        <description>OA[n-1]Rtop</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>GPAMP_OUT_INT</name>
                                        <description>GPAMP_OUT_INT Input</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>VSS</name>
                                        <description>Internal Grouund Connection</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>NSEL</name>
                            <description>Negative OA input selection.
Please refer to the device specific datasheet for exact channels available.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NC</name>
                                        <description>no connect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EXTPIN0</name>
                                        <description>external pin OAn-0</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EXTPIN1</name>
                                        <description>external pin OAn-1</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OANP1RBOT</name>
                                        <description>OA[n+1]Rbot</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OANRTAP</name>
                                        <description>OA[n]Rtap</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OANRTOP</name>
                                        <description>OA[n]Rtop</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SPARE</name>
                                        <description>Spare input</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MSEL</name>
                            <description>MSEL Mux selection. 
Please refer to the device specific datasheet for exact channels available.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NC</name>
                                        <description>no connect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EXTNPIN1</name>
                                        <description>external pin OAn-1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>VSS</name>
                                        <description>VSS</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DAC12OUT</name>
                                        <description>DAC12 Output</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OANM1RTOP</name>
                                        <description>OA[n-1]Rtop</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>GAIN</name>
                            <description>Gain setting. Refer to TRM for enumeration information.</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>OPA0_STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>RDY</name>
                            <description>OA ready status.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>OAxn is not ready.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>OAxn is ready.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
