therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                    <register>
                        <dim>2</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1</dimArrayIndex>
                        <name>TIMA0_OCTL_23[%s]</name>
                        <description>CCP Output Control Registers</description>
                        <addressOffset>0x58</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CCPOINV</name>
                                <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOINV</name>
                                            <description>No inversion</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INV</name>
                                            <description>Invert</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCPIV</name>
                                <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>LOW</name>
                                            <description>Low</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HIGH</name>
                                            <description>High</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CCPO</name>
                                <description>CCP Output Source</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>FUNCVAL</name>
                                            <description>Signal generator value (for example, PWM, triggered PWM)</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LOAD</name>
                                            <description>Load condition</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CMPVAL</name>
                                            <description>Compare value = counter condition</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZERO</name>
                                            <description>Zero condition</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CAPCOND</name>
                                            <description>Capture condition</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FAULTCOND</name>
                                            <description>Fault Condition</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC0_MIRROR_ALL</name>
                                            <description>Mirror CCP of first capture and compare register in counter group</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CC1_MIRROR_ALL</name>
                                            <description>Mirror CCP of second capture and compare register in counter group</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DEADBAND</name>
                                            <description>Deadband Inserted Output</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNTDIR</name>
                                            <description>Counter direction</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
