therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>40</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>TIMA1_COMMONREGS[%s]</name>
                    <description></description>
                    <addressOffset>0x1100</addressOffset>
                    <register>
                        <name>TIMA1_CCPD</name>
                        <description>CCP Direction</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>C0CCP0</name>
                                <description>Counter CCP0</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INPUT</name>
                                            <description>Input</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>OUTPUT</name>
                                            <description>Output</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>C0CCP1</name>
                                <description>Counter CCP1</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>INPUT</name>
                                            <description>Input</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>OUTPUT</name>
                                            <description>Output</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA1_ODIS</name>
                        <description>Output Disable</description>
                        <addressOffset>0x4</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>C0CCP0</name>
                                <description>Counter CCP0 Disable Mask
Defines whether CCP0 of Counter n is forced low or not</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CCP_OUTPUT_OCTL</name>
                                            <description>Output function as selected by the OCTL register CCPO field are provided to occpout[0].</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_OUTPUT_LOW</name>
                                            <description>CCP output occpout[0] is forced low.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>C0CCP1</name>
                                <description>Counter CCP1 Disable Mask
Defines whether CCP0 of Counter n is forced low or not</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CCP_OUTPUT_OCTL</name>
                                            <description>Output function as selected by the OCTL register CCPO field are provided to occpout[1].</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCP_OUTPUT_LOW</name>
                                            <description>CCP output occpout[1] is forced low.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA1_CCLKCTL</name>
                        <description>Counter Clock Control Register</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CLKEN</name>
                                <description>Clock Enable
Disables the clock gating to the module. SW has to explicitly program the value
 to 0 to gate the clock.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Clock is disabled.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLED</name>
                                            <description>Clock is enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA1_CPS</name>
                        <description>Clock Prescale Register</description>
                        <addressOffset>0xC</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>PCNT</name>
                                <description>Pre-Scale Count
This field specifies the pre-scale count value.  The selected TIMCLK source is divided by a value of (PCNT+1). 
A PCNT value of 0 divides TIMCLK by 1, effectively bypassing the divider.
A PCNT value of greater than 0 divides the TIMCLK source generating a slower clock</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA1_CPSV</name>
                        <description>Clock prescale count status register</description>
                        <addressOffset>0x10</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>CPSVAL</name>
                                <description>Current Prescale Count Value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA1_CTTRIGCTL</name>
                        <description>Timer Cross Trigger Control Register</description>
                        <addressOffset>0x14</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CTEN</name>
                                <description>Timer Cross trigger enable. This field is used to enable whether the SW or HW logic can generate a timer cross trigger event in the system.
These cross triggers are connected to the respective timer trigger in of the other timer IPs in the SOC power domain.

The timer cross trigger is essentially the combined logic of the HW and SW conditions controlling EN bit in the CTRCTL register.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Cross trigger generation disabled.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Cross trigger generation enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>EVTCTEN</name>
                                <description>Enable the Input Trigger Conditions to the Timer module as a condition for Cross Triggers. Refer  Figure 8 Cross Trigger Generation Path</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Cross trigger generation disabled.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Cross trigger generation enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>EVTCTTRIGSEL</name>
                                <description>Used to Select the subscriber port that should be used for input cross trigger. Refer  Figure 8 Cross Trigger Generation Path</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>FSUB0</name>
                                            <description>Use FSUB0 as cross trigger source.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FSUB1</name>
                                            <description>Use FSUB1 as cross trigger source.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>Z</name>
                                            <description>Use Zero event  as cross trigger source.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>L</name>
                                            <description>Use Load event as cross trigger source.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCD0</name>
                                            <description>Use CCD0 event  as cross trigger source.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCD1</name>
                                            <description>Use CCD1 event  as cross trigger source.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCD2</name>
                                            <description>Use CCD2 event  as cross trigger source.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCD3</name>
                                            <description>Use CCD3 event  as cross trigger source.</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCU0</name>
                                            <description>Use CCU0 event  as cross trigger source.</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCU1</name>
                                            <description>Use CCU1 event  as cross trigger source.</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCU2</name>
                                            <description>Use CCU2 event  as cross trigger source.</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCU3</name>
                                            <description>Use CCU3 event  as cross trigger source.</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMA1_CTTRIG</name>
                        <description>Timer Cross Trigger Register</description>
                        <addressOffset>0x1C</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <fields>
                            <field>
                                <name>TRIG</name>
                                <description>Generate Cross Trigger
This bit when programmed will generate a synchronized trigger condition all the cross trigger enabled Timer instances including current timer instance.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Cross trigger generation disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>GENERATE</name>
                                            <description>Generate Cross trigger pulse</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
