therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                <register>
                    <name>UART0_LINCTL</name>
                    <description>UART LIN Mode Control Register</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CTRENA</name>
                            <description>LIN Counter Enable. LIN counter will only count when enabled.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Counter disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Counter enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ZERONE</name>
                            <description>Zero on negative Edge of RXD. When enabled the counter is set to 0 and starts counting on a negative edge of RXD</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Zero on negative edge disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Zero on negative edge enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CNTRXLOW</name>
                            <description>Count while low Signal on RXD When counter is enabled and the signal on RXD is low, the counter increments.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Count while low Signal on UARTxRXD disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Count while low Signal on UARTxRXD enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LINC0CAP</name>
                            <description>Capture Counter on negative RXD Edge. When enabled the counter value is captured to LINC0 register on each negative RXD edge. A LINC0 interrupt is triggered when enabled.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Capture counter on negative UARTxRXD edge disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Capture counter on negative UARTxRXD edge enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LINC1CAP</name>
                            <description>Capture Counter on positive RXD Edge. When enabled the counter value is captured to LINC1 register on each positive RXD edge. A LINC1 interrupt is triggered when enabled.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Capture counter on positive UARTxRXD edge disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Capture counter on positive UARTxRXD edge enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LINC0_MATCH</name>
                            <description>Counter Compare Match Mode  When this bit is set to 1 a counter compare match with LINC0 register triggers an LINC0 interrupt when enabled.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Counter compare match mode disabled (capture mode enabled)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Counter compare match enabled (capture mode disabled)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UART0_LINC0</name>
                    <description>UART LIN Mode Capture 0 Register</description>
                    <addressOffset>0x1138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD falling edge and can generate a LINC0 interrupt when capture is enabled (LINC0CAP = 1).

If compare mode is enabled (LINC0_MATCH = 1), a counter match can generate a LINC0 interrupt.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UART0_LINC1</name>
                    <description>UART LIN Mode Capture 1 Register</description>
                    <addressOffset>0x113C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD rising edge and can generate a LINC1 interrupt when capture is enabled (LINC1CAP = 1)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UART0_IRCTL</name>
                    <description>eUSCI_Ax IrDA Control Word Register</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>IRTXPL</name>
                            <description>Transmit pulse length.
Pulse length t(PULSE) = (IRTXPLx + 1) / [2 * f(IRTXCLK)]
(IRTXCLK = functional clock of the UART)</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>IRRXPL</name>
                            <description>IrDA receive input UCAxRXD polarity</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>HIGH</name>
                                        <description>IrDA transceiver delivers a high pulse when a light pulse is seen</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LOW</name>
                                        <description>IrDA transceiver delivers a low pulse when a light pulse is seen</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>IREN</name>
                            <description>IrDA encoder/decoder enable</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>IrDA encoder/decoder disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>IrDA encoder/decoder enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>IRTXCLK</name>
                            <description>IrDA transmit pulse clock select</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>BITCLK</name>
                                        <description>IrDA encode data is based on the functional clock.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BRCLK</name>
                                        <description>IrDA encode data is based on the Baud Rate clock&lt; when select 8x oversampling, the IRTXPL cycle should less 8;  when select 16x oversampling, the IRTXPL cycle should less 16.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UART0_AMASK</name>
                    <description>Self Address Mask Register</description>
                    <addressOffset>0x1148</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000000ff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MSK</name>
                            <description>Self Address Mask for 9-Bit Mode  This field contains the address mask that creates a set of addresses that should be matched.  A 0 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register is don't care. A 1 bit in the MSK bitfield configures, that the corresponding bit in the ADDR bitfield of the UARTxADDR register must match.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UART0_ADDR</name>
                    <description>Self Address Register</description>
                    <addressOffset>0x114C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Self Address for 9-Bit Mode  This field contains the address that should be matched when UARTxAMASK is FFh.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UART0_CLKDIV2</name>
                    <description>Clock Divider</description>
                    <addressOffset>0x1160</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RATIO</name>
                            <description>Selects divide ratio of module clock</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIV_BY_1</name>
                                        <description>Do not divide clock source</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_2</name>
                                        <description>Divide clock source by 2</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_3</name>
                                        <description>Divide clock source by 3</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_4</name>
                                        <description>Divide clock source by 4</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_5</name>
                                        <description>Divide clock source by 5</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_6</name>
                                        <description>Divide clock source by 6</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_7</name>
                                        <description>Divide clock source by 7</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIV_BY_8</name>
                                        <description>Divide clock source by 8</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
