therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>UART2_INT_EVENT0[%s]</name>
                    <description></description>
                    <addressOffset>0x1020</addressOffset>
                    <register>
                        <name>UART2_INT_EVENT0_IIDX</name>
                        <description>Interrupt index</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>UART Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MIS registers. 15h-1Fh = Reserved</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No interrupt pending</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RTFG</name>
                                            <description>UART receive time-out interrupt; Interrupt Flag: RT; Interrupt Priority: Highest</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FEFG</name>
                                            <description>UART framing error interrupt; Interrupt Flag: FE</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PEFG</name>
                                            <description>UART parity error interrupt; Interrupt Flag: PE</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>BEFG</name>
                                            <description>UART break error interrupt; Interrupt Flag: BE</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>OEFG</name>
                                            <description>UART receive overrun error interrupt; Interrupt Flag: OE</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RXNE</name>
                                            <description>Negative edge on UARTxRXD interrupt; Interrupt Flag: RXNE</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RXPE</name>
                                            <description>Positive edge on UARTxRXD interrupt; Interrupt Flag: RXPE</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LINC0</name>
                                            <description>LIN capture 0 / match interrupt; Interrupt Flag: LINC0</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LINC1</name>
                                            <description>LIN capture 1 interrupt; Interrupt Flag: LINC1</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LINOVF</name>
                                            <description>LIN hardware counter overflow interrupt; Interrupt Flag: LINOVF</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RXIFG</name>
                                            <description>UART receive interrupt; Interrupt Flag: RX</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TXIFG</name>
                                            <description>UART transmit interrupt; Interrupt Flag: TX</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>EOT</name>
                                            <description>UART end of transmission interrupt (transmit serializer empty); Interrupt Flag: EOT</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MODE_9B</name>
                                            <description>9-bit mode address match interrupt; Interrupt Flag: MODE_9B</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CTS</name>
                                            <description>UART Clear to Send Modem interrupt; Interrupt Flag: CTS</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMA_DONE_RX</name>
                                            <description>DMA DONE on RX</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMA_DONE_TX</name>
                                            <description>DMA DONE on TX</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>NERR_EVT</name>
                                            <description>Noise Error Event</description>
                                            <value>0x12</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
