therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                <register>
                    <name>COMP2_CTL2</name>
                    <description>Control 2</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REFMODE</name>
                            <description>This bit requests ULP_REF bandgap operation in static mode or sampled mode. The local reference buffer and 8-bit DAC inside comparator module are also configured accordingly. 
Static mode operation offers higher accuracy but consumes higher current. Sampled mode operation consumes lower current but with relaxed reference voltage accuracy. Comparator requests for reference voltage from ULP_REF only when REFLVL &gt; 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STATIC</name>
                                        <description>ULP_REF bandgap, local reference buffer and 8-bit DAC inside comparator operate in static mode.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SAMPLED</name>
                                        <description>ULP_REF bandgap, local reference buffer and 8-bit DAC inside comparator operate in sampled mode.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REFSRC</name>
                            <description>These bits select the reference source for the comparator.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>OFF</name>
                                        <description>Reference voltage generator is disabled (local reference buffer as well as DAC).</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>VDDA_DAC</name>
                                        <description>VDDA selected as the reference source to DAC and DAC output applied as reference to comparator.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>VREF_DAC</name>
                                        <description>VREF selected as reference to DAC and DAC output applied as reference to comparator.</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>VREF</name>
                                        <description>VREF applied as reference to comparator. DAC is switched off.</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REFSEL</name>
                            <description>This bit selects if the selected reference voltage is applied to positive or negative terminal of the comparator.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>POSITIVE</name>
                                        <description>If EXCH bit is 0, the selected reference is applied to positive terminal. If EXCH bit is 1, the selected reference is applied to negative terminal.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>NEGATIVE</name>
                                        <description>If EXCH bit is 0, the selected reference is applied to negative terminal. If EXCH bit is 1, the selected reference is applied to positive terminal.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DACCTL</name>
                            <description>This bit determines if the comparator output or DACSW bit controls the selection between DACCODE0 and DACCODE1.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>COMPOUT_SEL</name>
                                        <description>Comparator output controls selection between DACCODE0 and DACCODE1</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DACSW_SEL</name>
                                        <description>DACSW bit controls selection between DACCODE0 and DACCODE1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DACSW</name>
                            <description>This bit selects between DACCODE0 and DACCODE1 to 8-bit DAC when DACCTL bit is 1.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DACCODE0_SEL</name>
                                        <description>DACCODE0 selected for 8-bit DAC</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DACCODE1_SEL</name>
                                        <description>DACCODE1 selected for 8-bit DAC</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BLANKSRC</name>
                            <description>These bits select the blanking source for the comparator.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Blanking source disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLANKSRC1</name>
                                        <description>Select Blanking Source 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLANKSRC2</name>
                                        <description>Select Blanking Source 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLANKSRC3</name>
                                        <description>Select Blanking Source 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLANKSRC4</name>
                                        <description>Select Blanking Source 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLANKSRC5</name>
                                        <description>Select Blanking Source 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BLANKSRC6</name>
                                        <description>Select Blanking Source 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SAMPMODE</name>
                            <description>Enable sampled mode of comparator.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Sampled mode disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Sampled mode enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_CTL3</name>
                    <description>Control 3</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DACCODE0</name>
                            <description>This is the first 8-bit DAC code. When the DAC code is 0x0 the DAC output will be 0 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>DACCODE1</name>
                            <description>This is the second 8-bit DAC code. When the DAC code is 0x0 the DAC output will be 0 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_STAT</name>
                    <description>Status</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT</name>
                            <description>This bit reflects the value of the comparator output. Writing to this bit has no effect on the comparator output.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LOW</name>
                                        <description>Comparator output is low</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGH</name>
                                        <description>Comparator output is high</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
