therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>ADC0_INT_EVENT0[%s]</name>
                    <description></description>
                    <addressOffset>0x1020</addressOffset>
                    <register>
                        <name>ADC0_INT_EVENT0_IIDX</name>
                        <description>Interrupt index</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>Interrupt index status</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0xA</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No bit is set means there is no pending interrupt request</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>OVIFG</name>
                                            <description>MEMRESx overflow interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TOVIFG</name>
                                            <description>Sequence Conversion time overflow interrupt</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HIGHIFG</name>
                                            <description>High threshold compare interrupt</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LOWIFG</name>
                                            <description>Low threshold compare interrupt</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INIFG</name>
                                            <description>Primary Sequence In range comparator interrupt</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMADONE</name>
                                            <description>DMA done interrupt, generated on DMA transfer completion,</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>UVIFG</name>
                                            <description>MEMRESx underflow interrupt</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG0</name>
                                            <description>MEMRES0 data loaded interrupt</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG1</name>
                                            <description>MEMRES1 data loaded interrupt</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG2</name>
                                            <description>MEMRES2 data loaded interrupt</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG3</name>
                                            <description>MEMRES3 data loaded interrupt</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG4</name>
                                            <description>MEMRES4 data loaded interrupt</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG5</name>
                                            <description>MEMRES5 data loaded interrupt</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG6</name>
                                            <description>MEMRES6 data loaded interrupt</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG7</name>
                                            <description>MEMRES7 data loaded interrupt</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG8</name>
                                            <description>MEMRES8 data loaded interrupt</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG9</name>
                                            <description>MEMRES9 data  loaded interrupt</description>
                                            <value>0x12</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG10</name>
                                            <description>MEMRES10 data  loaded interrupt</description>
                                            <value>0x13</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG11</name>
                                            <description>MEMRES11 data  loaded interrupt</description>
                                            <value>0x14</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG12</name>
                                            <description>MEMRES12 data  loaded interrupt</description>
                                            <value>0x15</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG13</name>
                                            <description>MEMRES13 data  loaded interrupt</description>
                                            <value>0x16</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG14</name>
                                            <description>MEMRES14 data  loaded interrupt</description>
                                            <value>0x17</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG15</name>
                                            <description>MEMRES15 data  loaded interrupt</description>
                                            <value>0x18</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG16</name>
                                            <description>MEMRES16 data loaded interrupt</description>
                                            <value>0x19</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG17</name>
                                            <description>MEMRES17 data loaded interrupt</description>
                                            <value>0x1A</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG18</name>
                                            <description>MEMRES18 data loaded interrupt</description>
                                            <value>0x1B</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG19</name>
                                            <description>MEMRES19 data loaded interrupt</description>
                                            <value>0x1C</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG20</name>
                                            <description>MEMRES20 data loaded interrupt</description>
                                            <value>0x1D</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG21</name>
                                            <description>MEMRES21 data loaded interrupt</description>
                                            <value>0x1E</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG22</name>
                                            <description>MEMRES22 data loaded interrupt</description>
                                            <value>0x1F</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MEMRESIFG23</name>
                                            <description>MEMRES23 data loaded interrupt</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
