therlab/Electronics-Design/DFP_backup/1.3.1/03_SVD/MSPM0G150X.svd
The timer cross trigger is essentially the combined logic of the HW and SW conditions controlling EN bit in the CTRCTL register.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Cross trigger generation disabled.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Cross trigger generation enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>EVTCTEN</name>
                                <description>Enable the Input Trigger Conditions to the Timer module as a condition for Cross Triggers. Refer  Figure 8 Cross Trigger Generation Path</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Cross trigger generation disabled.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Cross trigger generation enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>EVTCTTRIGSEL</name>
                                <description>Used to Select the subscriber port that should be used for input cross trigger. Refer  Figure 8 Cross Trigger Generation Path</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>FSUB0</name>
                                            <description>Use FSUB0 as cross trigger source.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FSUB1</name>
                                            <description>Use FSUB1 as cross trigger source.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>Z</name>
                                            <description>Use Zero event  as cross trigger source.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>L</name>
                                            <description>Use Load event as cross trigger source.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCD0</name>
                                            <description>Use CCD0 event  as cross trigger source.</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCD1</name>
                                            <description>Use CCD1 event  as cross trigger source.</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCD2</name>
                                            <description>Use CCD2 event  as cross trigger source.</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCD3</name>
                                            <description>Use CCD3 event  as cross trigger source.</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCU0</name>
                                            <description>Use CCU0 event  as cross trigger source.</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCU1</name>
                                            <description>Use CCU1 event  as cross trigger source.</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCU2</name>
                                            <description>Use CCU2 event  as cross trigger source.</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CCU3</name>
                                            <description>Use CCU3 event  as cross trigger source.</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMG8_CTTRIG</name>
                        <description>Timer Cross Trigger Register</description>
                        <addressOffset>0x1C</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <fields>
                            <field>
                                <name>TRIG</name>
                                <description>Generate Cross Trigger
This bit when programmed will generate a synchronized trigger condition all the cross trigger enabled Timer instances including current timer instance.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Cross trigger generation disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>GENERATE</name>
                                            <description>Generate Cross trigger pulse</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>192</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>TIMG8_COUNTERREGS[%s]</name>
                    <description></description>
                    <addressOffset>0x1800</addressOffset>
                    <register>
                        <name>TIMG8_CTR</name>
                        <description>Counter Register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>CCTR</name>
                                <description>Current Counter value</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>TIMG8_CTRCTL</name>
                        <description>Counter Control Register</description>
                        <addressOffset>0x4</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x0000ff80</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>EN</name>
                                <description>Counter Enable.  This bit allows the timer to advance  This bit is automatically cleared if REPEAT=0 (do not automatically reload) and the counter value equals zero.  CPU Write: A register write that sets the EN bit, the counter value is set per the CVAE value. Hardware: This bit may also be set as the result of an LCOND or ZCOND condition being met and the counter value changed to the load value or zero value, respectively.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLED</name>
                                            <description>Enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>REPEAT</name>
                                <description>Repeat.  The repeat bit controls whether the counter continues to advance following a zero event, or the exiting of a debug or fault condition.  If counting down, a zero event is followed by a load at the next advance condition. If counting up-down, a zero event is followed by an advance event (+1). The intent of encoding 3 is that if the debug condition is in effect, the generation of the load pulse is deferred until the debug condition is over. This allows the counter to reach zero before counting is suspended.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>REPEAT_0</name>
                                            <description>Does not automatically advance following a zero event.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>REPEAT_1</name>
                                            <description>Continues to advance following a zero event.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>REPEAT_2</name>
                                            <description>Reserved</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>REPEAT_3</name>
                                            <description>Continues to advance following a zero event if the debug mode is not in effect, or following the release of the debug mode.</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>REPEAT_4</name>
                                            <description>Reserved</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CM</name>
                                <description>Count Mode</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DOWN</name>
                                            <description>Down</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>UP_DOWN</name>
                                            <description>Up/Down</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>UP</name>
                                            <description>Counter counts up.</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CVAE</name>
                                <description>Counter Value After Enable.  This field specifies the initialization condition of the counter when the EN bit is changed from 0 to 1 by a write to the CTRCTL register. Note that an external event can also cause the EN bit to go active.</description>
                                <bitOffset>0x1C</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>LDVAL</name>
                                            <description>The counter is set to the LOAD register value</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>NOCHANGE</name>
                                            <description>The counter value is unchanged from its current value which could have been initialized by software</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ZEROVAL</name>
                                            <description>The counter is set to zero</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DRB</name>
                                <description>Debug Resume Behavior This bit specifies what the device does following the release/exit of debug mode.</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>RESUME</name>
                                            <description>Resume counting</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CVAE_ACTION</name>
                                            <description>Perform the action as specified by the CVAE field.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CLC</name>
                                <description>Counter Load Control.  This field specifies what controls the counter operation with respect to setting the counter to the LD register value. 

